doc/user-doc/mv-table-user-documentation.org
#+title: ~mv-table~ user documentation
   

* mv-table
** Introduction
   =mv-table= is a CLOS inspired data structure for storing and
   manipulating columns of data.  It supports several types of
   organization, storage, access, and operations.  It also supports
   reading to and writing from disk [fn:3].

   Being based on CLOS (and implemented using MOP), table definitions
   support inheritance and on-the-fly redefinition upon re-evaluation
   of the =deftable= form.

   =mv-table= can store, save and read most of CL's native types.  It
   can also store references to external data objects, such as images
   or documents that reside on disk.
   
** Table types
   :PROPERTIES:
   :ID:       wu17np515gg0
   :END:

   mv-table supports several table types:
   - column tables :: tables of columns of possibly unequal length.
                      Access to table elements is via columns names
                      and index of the entry in the column
   - square tables :: tables of columns of equal length.  Access to
                      table elements is either via columns names and
                      row name, index selection rule (subject to some
                      restrictions discussed below)
		      
		      Square tables are a specialization of column
                      tables.  They support all operations as column
                      tables and add additional ones.
   - matrix tables :: Store matrices of data of the same type.  The
                      primary mean of reference is by row and column
                      index (including ranges) or names
		      


   Tables are further defined by access type:
   - Random access :: The data is in memory or on disk
                      using a database
   - Sequential :: This type is primarily reserved for tables residing
                   on disk.  The two primary operations on these
                   tables are row-wise reading or writing.
		   
		   Column tables are accessed column by column, while
                   square and matrix tables row by row.

		   

   Tables are also defined as
   - Real :: a table as a single entity
   - Virtual :: a collection of several tables, possibly spread out
                over several machines

   Tables are also defined as
   - Static :: once defined and filled, its dimensions and/or content
                are not allowed to change
   - Dynamic :: tables are allowed to grow.  Real tables can have
                columns or rows added.  Virtual tables can accept new
                members.


   Data storage is implemented in several ways:
   - In memory as a collection of native or foreign vectors, or as a
     native or foreign matrix, or as a single native vector.
   - Disk files, such as CSV
   - External, using external applications (such as databases)
     
   Memory resident square tables with columns stored as vectors the
   most common are default.  Keys during initialization and slot or
   table  options are used to override the defaults.
   
** Table definition and initialization
   :PROPERTIES:
   :ID:       84qh5om04ag0
   :END:

   Tables are defined using the =deftable= macro and instantiated
   using the =make-instance= function.  The table definition and
   instantiation syntax is based on CLOS' =defclass= and
   =make-instance= [fn:1].  Under the hood, tables are implemented
   using MOP's extension to CLOS.

   Tables are defined using the =deftable= macro (similar to
   =defclass=).  The columns (slots) definitions define the table
   schema.  Tables are instantiated with the =make-table= function.

