documentation/user-doc/mv-table-user-documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>mv-table</code> user documentation</title>
<!-- 2014-05-28 Wed 08:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Mirko Vukovic" />


</head>
<body>
<div id="content">
<h1 class="title"><code>mv-table</code> user documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. mv-table</a>
<ul>
<li><a href="#sec-1-1">1.1. Introduction</a></li>
<li><a href="#sec-1-2">1.2. Table types</a></li>
<li><a href="#sec-1-3">1.3. Table definition and initialization</a></li>
<li><a href="#sec-1-4">1.4. File based tables</a></li>
<li><a href="#sec-1-5">1.5. Built-in column-types</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Note 1</a></li>
<li><a href="#sec-1-5-2">1.5.2. Note 2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Table types</a>
<ul>
<li><a href="#sec-2-1">2.1. Table states</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. States of column tables</a></li>
<li><a href="#sec-2-1-2">2.1.2. States of square tables</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Table meta-data</a></li>
</ul>
</li>
<li><a href="#sec-3">3. mv-table by example</a>
<ul>
<li><a href="#sec-3-1">3.1. Building tables</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Introductory example</a></li>
<li><a href="#sec-3-1-2">3.1.2. Using reading and writing tables</a></li>
<li><a href="#sec-3-1-3">3.1.3. How tables store data</a></li>
<li><a href="#sec-3-1-4">3.1.4. Table initialization via initforms and initiargs</a></li>
<li><a href="#sec-3-1-5">3.1.5. Table inheritance</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Accessing table contents</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Low level/developer methods</a></li>
<li><a href="#sec-3-2-2">3.2.2. High level/user access methods</a></li>
<li><a href="#sec-3-2-3">3.2.3. Column accessor</a></li>
<li><a href="#sec-3-2-4">3.2.4. Table saving and loading</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Selecting parts of a table</a></li>
<li><a href="#sec-3-4">3.4. Generic functions and methods: From tables to tables and/or statistics</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Writing methods with tables</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Dictionary</a>
<ul>
<li><a href="#sec-4-1">4.1. Table definition and instantiation</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. <i>macro</i> <code>deftable</code></a></li>
<li><a href="#sec-4-1-2">4.1.2. <i>Function</i> <code>make-table</code></a></li>
<li><a href="#sec-4-1-3">4.1.3. <i>Macro</i> defcolumn</a></li>
<li><a href="#sec-4-1-4">4.1.4. <i>Function</i> not-nullable</a></li>
<li><a href="#sec-4-1-5">4.1.5. <i>Function</i> extract-schema</a></li>
<li><a href="#sec-4-1-6">4.1.6. <i>Function</i> schema</a></li>
<li><a href="#sec-4-1-7">4.1.7. <i>Generic Function</i> update-instance-for-redefined-table</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Table queries</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. <i>Function</i> <b>in</b></a></li>
<li><a href="#sec-4-2-2">4.2.2. <i>Function</i> <b>select</b></a></li>
<li><a href="#sec-4-2-3">4.2.3. <i>Function</i> matching</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Table operations</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. <i>Function</i> delete-all-rows</a></li>
<li><a href="#sec-4-3-2">4.3.2. <i>Function</i> delete-rows</a></li>
<li><a href="#sec-4-3-3">4.3.3. <i>Function</i> insert-row</a></li>
<li><a href="#sec-4-3-4">4.3.4. <i>Function-maybe</i> column</a></li>
<li><a href="#sec-4-3-5">4.3.5. <i>Function</i> column-value</a></li>
<li><a href="#sec-4-3-6">4.3.6. <i>Function</i> sorted-rows</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Access to table elements</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. <i>Function</i> <b>advance-row</b></a></li>
<li><a href="#sec-4-4-2">4.4.2. <i>Function</i> <code>cell-value</code></a></li>
<li><a href="#sec-4-4-3">4.4.3. <i>Function</i> <code>column-values</code></a></li>
<li><a href="#sec-4-4-4">4.4.4. <i>Macro</i> <b>do-rows</b></a></li>
<li><a href="#sec-4-4-5">4.4.5. <i>Macro</i> <b>do-rows*</b></a></li>
<li><a href="#sec-4-4-6">4.4.6. <i>Condition</i> <b>end-of-table</b></a></li>
<li><a href="#sec-4-4-7">4.4.7. <i>Function</i> nth-row</a></li>
<li><a href="#sec-4-4-8">4.4.8. <i>Macro</i> map-rows</a></li>
<li><a href="#sec-4-4-9">4.4.9. <i>Condition</i> <code>nonexistent-row</code></a></li>
<li><a href="#sec-4-4-10">4.4.10. <i>Condition</i> <code>nonexistent-column</code></a></li>
<li><a href="#sec-4-4-11">4.4.11. <i>Function</i> <b>row-index</b></a></li>
<li><a href="#sec-4-4-12">4.4.12. <i>Function</i> <code>row-values</code></a></li>
<li><a href="#sec-4-4-13">4.4.13. <i>Function</i> <code>table-row</code></a></li>
<li><a href="#sec-4-4-14">4.4.14. <i>Function</i> <code>table-value</code></a></li>
<li><a href="#sec-4-4-15">4.4.15. <i>Generic Function</i> <b>value</b></a></li>
<li><a href="#sec-4-4-16">4.4.16. <i>Macro</i> <code>with-columns</code></a></li>
<li><a href="#sec-4-4-17">4.4.17. <i>Macro</i> <code>with-column-values</code></a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5. Other operations</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. <i>Function</i> load-table</a></li>
<li><a href="#sec-4-5-2">4.5.2. <i>Function</i> table</a></li>
<li><a href="#sec-4-5-3">4.5.3. <i>Function</i> table-size</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> mv-table</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>mv-table</code> is a CLOS inspired data structure for storing and
manipulating columns of data.  It supports several types of
organization, in-memory storage, access, and operations.  It also
supports reading to and writing from disk <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
Being based on CLOS (and implemented using MOP), table definitions
support inheritance and on-the-fly redefinition upon re-evaluation
of the <code>deftable</code> form.
</p>

<p>
<code>mv-table</code> can store, save and read most of CL's native types.  It
can also store references to external data objects, such as images
or documents that reside on disk.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><a id="wu17np515gg0" name="wu17np515gg0"></a><span class="section-number-3">1.2</span> Table types</h3>
<div class="outline-text-3" id="text-1-2">
<p>
mv-table supports several table types:
</p>
<dl class="org-dl">
<dt> column tables </dt><dd>tables of columns of possibly unequal length.
Access to table elements is via columns names
and index of the entry in the column
</dd>
<dt> square tables </dt><dd>tables of columns of equal length.  Access to
table elements is either via columns names and
row index or rows selection rules (subject to
some restrictions discussed below) and column
name.

<p>
Square tables are a specialization of column
tables.  They support all operations as column
tables and add additional ones.
</p>
</dd>
<dt> matrix tables </dt><dd>Store matrices of data of the same type.  The
primary mean of reference is by row and column
index
</dd>
</dl>



<p>
Tables are further defined by access type:
</p>
<dl class="org-dl">
<dt> Random access </dt><dd>The data is in memory or on disk
using a database
</dd>
<dt> Sequential </dt><dd>This type is primarily reserved for tables residing
on disk.  The two primary operations on these
tables are row-wise reading or writing.

<p>
Column tables are accessed column by column, while
square and matrix tables row by row.
</p>
</dd>
</dl>


<p>
Data storage is implemented in several ways:
</p>
<ul class="org-ul">
<li>In memory as a collection of native or foreign vectors, or as a
native or foreign matrix, or as a single native vector.
</li>
<li>Disk files, such as CSV
</li>
<li>External, using external applications (such as databases)
</li>
</ul>

<p>
Memory resident square tables with columns stored as vectors the
most common are default.  Keys during initialization and slot or
table  options are used to override the defaults.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><a id="84qh5om04ag0" name="84qh5om04ag0"></a><span class="section-number-3">1.3</span> Table definition and initialization</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Tables are defined using the <code>deftable</code> macro and instantiated
using the <code>make-instance</code> function.  The table definition and
instantiation syntax is based on CLOS' <code>defclass</code> and
=make-instance=<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.  Under the hood, tables are implemented
using MOP's extension to CLOS.
</p>

<p>
Tables are defined using the <code>deftable</code> macro (similar to
<code>defclass</code>).  The columns (slots) definitions define the table
schema.  Tables are instantiated with the <code>make-table</code> function.
</p>
</div>
</div>
