doc/user-doc/mv-table-user-documentation.org
** File based tables
   :PROPERTIES:
   :ID:       cvj8u6002gg0
   :END:

    Files of column data (such as CSV) can be considered as tables.
    =mv-tables= can be access such files using its native syntax.

    File based tables are specified by setting the =:organization=
    table option to =:file=.  This implies sequential access.  The
    user has access to only a single row/column of a square or
    matrix/columns table.

    For square or matrix tables, these tables are accessed row by row,
    starting from the first row.  For column tables, they are accessed
    column by column.

    When the =:action= option is =:read-only=, the =:insert-row=
    operation reads a record from the file and places it in the
    =current-row= row-accessor for square or matrix tables.
    =:insert-column= will read the contents of the next record into
    the =current-column= column accessor for column tables.  As an
    example:
    #+BEGIN_SRC lisp
      (insert-row table stream)
    #+END_SRC

    When the =:action= option is =:write-only=, the =:insert-row= will
    create a new record in the file.

    This format is used mainly for table i/o.  A temporary sequential
    read-only table is created.  Repeated calls to =insert-row= read
    its contents which are available via the row-accessor.  These
    contents can then be added to an in-memory table.  Using the
    =do-rows= macro this is done as follows:
    #+BEGIN_SRC lisp
          (do-rows (read-only-row read-only-table)
            (insert-row in-memory-table
                        (row-contents read-only-row)))
    #+END_SRC


** Built-in column-types

   To facilitate saving and reading in of tables from disk, we place
   restrictions on types of values that can be stored in tables.  We
   store only values that can be read in by the lisp reader[fn:4] and
   to which we can apply equality and comparison tests.

   Table columns can store all CL types that can be handled by the
   lisp reader.  We list them
   - symbols (including t, nil, and keyword symbols)
   - number and its sub-types
   - characters
   - string and its sub-types
   - sequences
     - vectors and arrays
     - lists
     - foreign vectors and arrays
   - lambda forms
     
     
   The following table lists the default comparators, and unbound
   values.  Unspecified entries have to be defined by the user in the
   column schema.
   
   | Type      | Equality    | Comparator  | Null        |
   |-----------+-------------+-------------+-------------|
   | Symbol    | #'eq        | #'string>   | unspecified |
   | Number    | #'=         | #'>         | nil         |
   | Character | #'char=     | #'char>     | nil         |
   | String    | #'string=   | #'string>   | nil         |
   | Vector    | unspecified | unspecified | nil         |
   | Array     | unspecified | unspecified | nil         |
   | List      | unspecified | unspecified | unspecified |
   | λ form    | unspecified | unspecified | null        |
   

*** Note 1
    Storage of vectors and arrays can be modified using the
    =value-normalizer= function.  The input sequence can be converted
    to a more efficient sequence by that function.  This guarantees
    that the sequence will be stored in the same manner after it is
    read in from the table.

*** Note 2
    Lambda forms are evaluated in the following environment:
    - Table meta-data is available in a lexical environment shared by
      all the lambda forms of that column.  Consequences are
      unspecified if a lambda-form modifies a table meta-data value -
      although it is our intent to provide for that functionality
    - Each lambda form has access to all the row values via the
      row-accessor for that row.  This means that the lambda form can
      read and set values of other cells in the same row.  The reading
      and setting is done via the reader & writer methods, which
      includes all the checking and normalization procedures.
* Table types
  There are two types of tables:
  - column :: columns of unequal length
  - square :: columns of equal length
    
    
  The ~column~ table is the most primitive kind of table.  Their
  properties are compared here:
  | Property          | Column | Square |
  |-------------------+--------+--------|
  | Column accessor   | yes    | yes    |
  | min, max length   | yes    | yes    |
  | Loop over columns | yes    | yes    |
  | Length            | no     | yes    |
  | Element accessor  | no     | yes    |
  | Row selector      | no     | yes    |
  | Loop over rows    | no     | yes    |

  Note that the column tables do not have a row count, only minimum
  and maximum row count
** Table states
   When instantiated, the table is in the empty state.  From there,
   things can go in several directions

*** States of column tables
    - empty
    - to be done
    

    # #+BEGIN_SRC lisp
    #   (defmethod (setf table-column) (vector (table curtain) column-name vector)
    # 	(when (min-row-count-specified-p table)
    # 	  (if (geq (length vector) (min-row-count table))
    # 		(setf min-test t)
    # 		(error 'vector-too-short)))
    # 	(when (max-row-count-specified-p table)
    # 	  (if (leq (length vector) (max-row-count table))
    # 	      (setf max-test t)
    # 	      (error 'vector-too-long)))
    # 	(setf (slot-value table column-name) vector
    # 	      (min-row-count table) (min (length vector)
    # 					 (min-row-count table))
    # 	      (max-row-count table) (max (length vector)
    # 					 (max-row-count table))))
    # #+END_SRC

*** States of square tables

  Table contents are accessed by 
  
** Table meta-data

   A =def-table= can contain an arbitrary number of meta-data table
   options other than the predefined ones.

   Table meta-data is accessed using the accessor by the same name as
   the meta-data options.

   Meta-data is defined and initialized prior to column
   initialization.

   It is set using the make-table method using keyword arguments.
   This data is available to the =initialize-instance= =:after= method
   to initialize column values.
* mv-table by example

** Building tables
