documentation/user-doc/mv-table-user-documentation.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><a id="cvj8u6002gg0" name="cvj8u6002gg0"></a><span class="section-number-3">1.4</span> File based tables</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Files of column data (such as CSV) can be considered as tables.
<code>mv-tables</code> can be access such files using its native syntax.
</p>

<p>
File based tables are specified by setting the <code>:organization</code>
table option to <code>:file</code>.  This implies sequential access.  The
user has access to only a single row/column of a square or
matrix/columns table.
</p>

<p>
For square or matrix tables, these tables are accessed row by row,
starting from the first row.  For column tables, they are accessed
column by column.
</p>

<p>
When the <code>:action</code> option is <code>:read-only</code>, the <code>:insert-row</code>
operation reads a record from the file and places it in the
<code>current-row</code> row-accessor for square or matrix tables.
<code>:insert-column</code> will read the contents of the next record into
the <code>current-column</code> column accessor for column tables.  As an
example:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(insert-row table stream)
</pre>
</div>

<p>
When the <code>:action</code> option is <code>:write-only</code>, the <code>:insert-row</code> will
create a new record in the file.
</p>

<p>
This format is used mainly for table i/o.  A temporary sequential
read-only table is created.  Repeated calls to <code>insert-row</code> read
its contents which are available via the row-accessor.  These
contents can then be added to an in-memory table.  Using the
<code>do-rows</code> macro this is done as follows:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(do-rows (read-only-row read-only-table)
  (insert-row in-memory-table
	      (row-contents read-only-row)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Built-in column-types</h3>
<div class="outline-text-3" id="text-1-5">
<p>
To facilitate saving and reading in of tables from disk, we place
restrictions on types of values that can be stored in tables.  We
store only values that can be read in by the lisp reader<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup> and
to which we can apply equality and comparison tests.
</p>

<p>
Table columns can store all CL types that can be handled by the
lisp reader.  We list them
</p>
<ul class="org-ul">
<li>symbols (including t, nil, and keyword symbols)
</li>
<li>number and its sub-types
</li>
<li>characters
</li>
<li>string and its sub-types
</li>
<li>sequences
<ul class="org-ul">
<li>vectors and arrays
</li>
<li>lists
</li>
<li>foreign vectors and arrays
</li>
</ul>
</li>
<li>lambda forms
</li>
</ul>


<p>
The following table lists the default comparators, and unbound
values.  Unspecified entries have to be defined by the user in the
column schema.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Equality</th>
<th scope="col" class="left">Comparator</th>
<th scope="col" class="left">Null</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Symbol</td>
<td class="left">#'eq</td>
<td class="left">#'string&gt;</td>
<td class="left">unspecified</td>
</tr>

<tr>
<td class="left">Number</td>
<td class="left">#'=</td>
<td class="left">#'&gt;</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">Character</td>
<td class="left">#'char=</td>
<td class="left">#'char&gt;</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">String</td>
<td class="left">#'string=</td>
<td class="left">#'string&gt;</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">Vector</td>
<td class="left">unspecified</td>
<td class="left">unspecified</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">Array</td>
<td class="left">unspecified</td>
<td class="left">unspecified</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="left">List</td>
<td class="left">unspecified</td>
<td class="left">unspecified</td>
<td class="left">unspecified</td>
</tr>

<tr>
<td class="left">λ form</td>
<td class="left">unspecified</td>
<td class="left">unspecified</td>
<td class="left">null</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Note 1</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Storage of vectors and arrays can be modified using the
<code>value-normalizer</code> function.  The input sequence can be converted
to a more efficient sequence by that function.  This guarantees
that the sequence will be stored in the same manner after it is
read in from the table.
</p>
</div>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Note 2</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Lambda forms are evaluated in the following environment:
</p>
<ul class="org-ul">
<li>Table meta-data is available in a lexical environment shared by
all the lambda forms of that column.  Consequences are
unspecified if a lambda-form modifies a table meta-data value -
although it is our intent to provide for that functionality
</li>
<li>Each lambda form has access to all the row values via the
row-accessor for that row.  This means that the lambda form can
read and set values of other cells in the same row.  The reading
and setting is done via the reader &amp; writer methods, which
includes all the checking and normalization procedures.
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Table types</h2>
<div class="outline-text-2" id="text-2">
<p>
There are two types of tables:
</p>
<dl class="org-dl">
<dt> column </dt><dd>columns of unequal length
</dd>
<dt> square </dt><dd>columns of equal length
</dd>
</dl>


<p>
The <code>column</code> table is the most primitive kind of table.  Their
properties are compared here:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Property</th>
<th scope="col" class="left">Column</th>
<th scope="col" class="left">Square</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Column accessor</td>
<td class="left">yes</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">min, max length</td>
<td class="left">yes</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">Loop over columns</td>
<td class="left">yes</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">Length</td>
<td class="left">no</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">Element accessor</td>
<td class="left">no</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">Row selector</td>
<td class="left">no</td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left">Loop over rows</td>
<td class="left">no</td>
<td class="left">yes</td>
</tr>
</tbody>
</table>

<p>
Note that the column tables do not have a row count, only minimum
and maximum row count
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Table states</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When instantiated, the table is in the empty state.  From there,
things can go in several directions
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> States of column tables</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>empty
</li>
<li>to be done
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> States of square tables</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Table contents are accessed by 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Table meta-data</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A <code>def-table</code> can contain an arbitrary number of meta-data table
options other than the predefined ones.
</p>

<p>
Table meta-data is accessed using the accessor by the same name as
the meta-data options.
</p>

<p>
Meta-data is defined and initialized prior to column
initialization.
</p>

<p>
It is set using the make-table method using keyword arguments.
This data is available to the <code>initialize-instance</code> <code>:after</code> method
to initialize column values.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> mv-table by example</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Building tables</h3>
