doc/user-doc/mv-table-user-documentation.org
*** Introductory example
    A table is defined using the =deftable= macro which is based on the
    =defclass= syntax, with some extensions (which are implemented via
    MOP).  An example:
    #+BEGIN_SRC lisp
      (deftable flight-path ()
       	((time :storage 'vector
	       :element-type 'float)
	 (distance :storage 'foreign-vector
		   :element-type 'double-float)
	 (altitude :documentation "Plane altitude"
		   :element-type 'number)
	 (bearing :storage nil)
	 (radar :element-type 'string
	       	:documentation "control tower identifier"))
       	(:documentation "Table with a plane flight path")
       	(:build-method :columns)
       	(:max-rows 1500))
    #+END_SRC
    The columns of this table are either native vectors,
    foreign-vectors (from the Antic/Grid library), or undefined, which
    implies native vectors.  The element type in the columns is also
    defined.  It must be a valid CL type.  The build method specifies
    that we will load the table by loading the columns.  We also
    specify the maximum number of rows the table can hold.

    With the table defined, we can make an instance of it:
    #+BEGIN_SRC lisp
      (setq flight-xyz (make-table 'flight-path))
    #+END_SRC
    At this point, it is an empty table.  With the table initialized,
    we can load the data:
    #+BEGIN_SRC lisp
      (setf (time flight-xyz) a-sequence
	    (distance flight-xyz) another-sequence
	    (bearing flight-xyz) yet-another-another-sequence)
    #+END_SRC
    The setf writer methods will try to coerce the supplied sequences
    into the specified vector type and coerce data types according to
    the table schema.

    The column =:storage= type is important only when we are accessing
    whole columns (such as storing or extracting).  Otherwise, it is
    immaterial.

    The =deftable= syntax allows for inheritance in table
    definitions.  This is discussed later.
      
*** Using reading and writing tables

    Files of column data (such as CSV) can be considered as tables.
    =mv-tables= can be access such files using its syntax.
    
    The reading of data and importing it into a table can also be done
    within the table framework, using auxiliary tables.

    Using this framework, we will
    1. Define a table
    2. Make an instance pointing to an existing CSV file.  Sequential
       reading of records is accomplished by sequential access of
       table rows
    3. Create another instance, this one in memory, and load it using
       the first instance
    4. Create another instance, pointing to a new CSV file.  Adding
       new rows to this instance writes records to the new file

    The methods presented very verbose.  But using introspection and
    macrology, the final user interface may be substantially reduced.

    A single table definition will suffice for all instances[fn:2]:
    #+BEGIN_SRC lisp
      (deftable flight-path ()
        ((time :storage array
               :element-type 'float
               :initform '(time-entry file))
         (distance :storage 'foreign-vector
                   :element-type 'double-float
                   :initform '(distance-entry file))
         (altitude :documentation "Plane altitude"
                   :element-type 'number
                   :initform '(altitude-entry file))
         (bearing :storage nil
                  :initform '(bearing-entry file))
         (radar :element-type 'string
                :documentation "control tower identifier"
                :initform '(radar-entry file)))
        ;; build method, table type, access, sources may be deduced from
        ;; instantiation arguments, and are unnecessary
       #| (:build-method :row-wise)
        (:table-type :sequential)
        (:access :read-only)
        (:sources file)|#)   
    #+END_SRC

    This table accessing the CSV data on disk is initialized by
    executing
    #+BEGIN_SRC lisp
      (setf read-only-table
            (make-table 'flight-path
                        :source #P"/some-file.txt"
                        :format :csv
                        :if-does-not-exist :error))
    #+END_SRC
    Being sequential, the table can iterate over rows and provide
    access to contents of each row, one at a time.
    
    The fact that the /source/ is a pathname (or a stream) will
    trigger a mechanism to open the file, sequentially read it using
    defined format, and close it when the end is reached.

    Specifying the source to be a file has side-effects on the table
    definition:
    - Read-only table
    - Sequential access
    - The table source is automatically assigned

      
    We will access the table row, by row.  The row contents will
    automatically be coerced to the required type.  And we will then
    build an in-memory table.

    The in-memory table is instantiated as follows
    #+BEGIN_SRC lisp
      (setf in-memory-table
            (make-table 'flight-path))
    #+END_SRC
    
    We can load the new table as follows:
    #+BEGIN_SRC lisp
      (do-rows (row read-only-table)
        (add-row in-memory-table
                 (row-contents row)))
    #+END_SRC
    In this code, =row= is an /accessor/ to the table row.  It is an
    object.  We use this object to get access to row contents.

    One can also use =loop= and [[id:0wqhhju04gg0][advance-row]]:
    #+BEGIN_SRC lisp
      (loop :for row = (advance-row table 1 nil :eot)
         :if (equal row :eot)
         :do (return)
         :else :do (add-row in-memory-table
                            (row-contents row)))
    #+END_SRC

    The first invocation of =add-row= will set the =in-memory-table=
    build method to =:row-wise=

    
#     In principle, we can have multiple sources, and the each column
#     can be derived from a different source, but this is not applicable
#     to reading a table from multiple files.


    We have used the table machinery to standardize reading of files.
    We can also use it to standardize writing of files.  
    #+BEGIN_SRC lisp
      (setf output-table
             (make-table 'flight-path
                         :source in-memory-table
                         :format :internal ;; or :csv
                         :storage #P"/output-file.dat"
                         :if-exists :supersede))
    #+END_SRC
    Setting the storage as a file or stream again sets the table as
    - write-only table
    - Sequential access
    - Build-method is =row-wise=


    Adding rows to the table amounts to writing table records to it:
    #+BEGIN_SRC lisp
      (do-rows (row in-memory-table)
        (add-row output-table
                 (row-contents row)))
      (finalize-table)
    #+END_SRC
    The last statement will close the table (or stream)

*** How tables store data
    Storage can be one of
    - columns
    - matrix
    - a file
      
    The file format (=:format= keyword) can further be used to
    specify a database or other file format.

    Tables saved under the internal format also save the meta-data.
    CSV tables save the table meta-data in an auxiliary file, also in
    CSV format.

