documentation/user-doc/mv-table-user-documentation.html
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Introductory example</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
A table is defined using the <code>deftable</code> macro which is based on the
<code>defclass</code> syntax, with some extensions (which are implemented via
MOP).  An example:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable flight-path ()
  ((time :storage 'vector
	 :element-type 'float)
   (distance :storage 'foreign-vector
	     :element-type 'double-float)
   (altitude :documentation "Plane altitude"
	     :element-type 'number)
   (bearing :storage nil)
   (radar :element-type 'string
	  :documentation "control tower identifier"))
  (:documentation "Table with a plane flight path")
  (:build-method :columns)
  (:max-rows 1500))
</pre>
</div>
<p>
The columns of this table are either native vectors,
foreign-vectors (from the Antic/Grid library), or undefined, which
implies native vectors.  The element type in the columns is also
defined.  It must be a valid CL type.  The build method specifies
that we will load the table by loading the columns.  We also
specify the maximum number of rows the table can hold.
</p>

<p>
With the table defined, we can make an instance of it:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setq flight-xyz (make-table 'flight-path))
</pre>
</div>
<p>
At this point, it is an empty table.  With the table initialized,
we can load the data:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf (time flight-xyz) a-sequence
      (distance flight-xyz) another-sequence
      (bearing flight-xyz) yet-another-another-sequence)
</pre>
</div>
<p>
The setf writer methods will try to coerce the supplied sequences
into the specified vector type and coerce data types according to
the table schema.
</p>

<p>
The column <code>:storage</code> type is important only when we are accessing
whole columns (such as storing or extracting).  Otherwise, it is
immaterial.
</p>

<p>
The <code>deftable</code> syntax allows for inheritance in table
definitions.  This is discussed later.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Using reading and writing tables</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Files of column data (such as CSV) can be considered as tables.
<code>mv-tables</code> can be access such files using its syntax.
</p>

<p>
The reading of data and importing it into a table can also be done
within the table framework, using auxiliary tables.
</p>

<p>
Using this framework, we will
</p>
<ol class="org-ol">
<li>Define a table
</li>
<li>Make an instance pointing to an existing CSV file.  Sequential
reading of records is accomplished by sequential access of
table rows
</li>
<li>Create another instance, this one in memory, and load it using
the first instance
</li>
<li>Create another instance, pointing to a new CSV file.  Adding
new rows to this instance writes records to the new file
</li>
</ol>

<p>
The methods presented very verbose.  But using introspection and
macrology, the final user interface may be substantially reduced.
</p>

<p>
A single table definition will suffice for all instances<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable flight-path ()
  ((time :storage array
	 :element-type 'float
	 :initform '(time-entry file))
   (distance :storage 'foreign-vector
	     :element-type 'double-float
	     :initform '(distance-entry file))
   (altitude :documentation "Plane altitude"
	     :element-type 'number
	     :initform '(altitude-entry file))
   (bearing :storage nil
	    :initform '(bearing-entry file))
   (radar :element-type 'string
	  :documentation "control tower identifier"
	  :initform '(radar-entry file)))
  ;; build method, table type, access, sources may be deduced from
  ;; instantiation arguments, and are unnecessary
 #| (:build-method :row-wise)
  (:table-type :sequential)
  (:access :read-only)
  (:sources file)|#)
</pre>
</div>

<p>
This table accessing the CSV data on disk is initialized by
executing
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf read-only-table
      (make-table 'flight-path
		  :source #P"/some-file.txt"
		  :format :csv
		  :if-does-not-exist :error))
</pre>
</div>
<p>
Being sequential, the table can iterate over rows and provide
access to contents of each row, one at a time.
</p>

<p>
The fact that the <i>source</i> is a pathname (or a stream) will
trigger a mechanism to open the file, sequentially read it using
defined format, and close it when the end is reached.
</p>

<p>
Specifying the source to be a file has side-effects on the table
definition:
</p>
<ul class="org-ul">
<li>Read-only table
</li>
<li>Sequential access
</li>
<li>The table source is automatically assigned
</li>
</ul>


<p>
We will access the table row, by row.  The row contents will
automatically be coerced to the required type.  And we will then
build an in-memory table.
</p>

<p>
The in-memory table is instantiated as follows
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf in-memory-table
      (make-table 'flight-path))
</pre>
</div>

<p>
We can load the new table as follows:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(do-rows (row read-only-table)
  (add-row in-memory-table
	   (row-contents row)))
</pre>
</div>
<p>
In this code, <code>row</code> is an <i>accessor</i> to the table row.  It is an
object.  We use this object to get access to row contents.
</p>

<p>
One can also use <code>loop</code> and <a href="#sec-4-4-1">advance-row</a>:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(loop :for row = (advance-row table 1 nil :eot)
   :if (equal row :eot)
   :do (return)
   :else :do (add-row in-memory-table
		      (row-contents row)))
</pre>
</div>

<p>
The first invocation of <code>add-row</code> will set the <code>in-memory-table</code>
build method to <code>:row-wise</code>
</p>


<p>
We have used the table machinery to standardize reading of files.
We can also use it to standardize writing of files.  
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf output-table
       (make-table 'flight-path
		   :source in-memory-table
		   :format :internal ;; or :csv
		   :storage #P"/output-file.dat"
		   :if-exists :supersede))
</pre>
</div>
<p>
Setting the storage as a file or stream again sets the table as
</p>
<ul class="org-ul">
<li>write-only table
</li>
<li>Sequential access
</li>
<li>Build-method is <code>row-wise</code>
</li>
</ul>


<p>
Adding rows to the table amounts to writing table records to it:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(do-rows (row in-memory-table)
  (add-row output-table
	   (row-contents row)))
(finalize-table)
</pre>
</div>
<p>
The last statement will close the table (or stream)
</p>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> How tables store data</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Storage can be one of
</p>
<ul class="org-ul">
<li>columns
</li>
<li>matrix
</li>
<li>a file
</li>
</ul>

<p>
The file format (<code>:format</code> keyword) can further be used to
specify a database or other file format.
</p>

<p>
Tables saved under the internal format also save the meta-data.
CSV tables save the table meta-data in an auxiliary file, also in
CSV format.
</p>
</div>
</div>
