doc/user-doc/mv-table-user-documentation.org
*** Table initialization via initforms and initiargs

    We can use initforms and initargs to build a table of sines
    #+BEGIN_SRC lisp
            (deftable sin-table ()
              ((x :storage array
                  :element-type 'float
                  :initform '(range 0 pi 21))
               (y :storage array
                  :element-type 'float
                  :initform '(sin x)))
              (:documentation "Table of the sin function"))
    #+END_SRC
    The x column can be initialized either via make-table or using
    the :default-initargs definition in =deftable=

    We get a table of 21 values of sin between 0 and 2π with:
    #+BEGIN_SRC lisp
      (make-table 'sin-table)
    #+END_SRC

    Of course, the following works as well:
    #+BEGIN_SRC lisp
      (make-instance 'sin-table :x (range 0 1d0 51))
    #+END_SRC
    Now we have a table of 51 values of ~sin~.

    How does this work?  Because we specified the value of column x,
    the table build method is =column=.  This allows us to setf values
    of the y column.
    
    Note that if we change the values of ~x~, the values of ~y~ will
    not be automatically updated.  For that, we will have to re-derive
    ~y~ explicitly.  Tables have no intelligence or knowledge of data
    dependency.  That has to be added by the user code.


    Table contents can be derived from other tables:
    #+BEGIN_SRC lisp
      (deftable derived ()
       	((sum :storage array
	      :element-type 'float)))
      
      (defmethod initialize-instance :after ((self derived) &key t1 t2
							      &allow-other-keys)
       	(setf (column self 'sum)
	      (map-rows (lambda (row-t1 row-t2)
			  (+ (column-value row-t1 'A)
			     (column-value row-t2 'B)))
		       	t1 t2)))
    #+END_SRC
    This object initializes the ~sum~ column using values of
    columns A and B from tables t1 and t2 respectively.


    A final example of a table initialization involves table
    meta-data.  We define a table that will compute the calendar for a
    month.  The year and month are stored as the :meta-data table
    options.  Their values are available in the =initialize-instance=
    =:after= method.
    #+BEGIN_SRC lisp
      (deftable calendar ()
        ((day)
         (day-of-week))
        (:meta-data
         :year
         :month))
      
      (defmethod initialize-instance :after ((self calendar) &key
                                             &allow-other-keys)
        (let* ((days-of-month (days-of-month (year self) (month self)))
               (days-of-week (mapcar (lambda (day)
                                       (day-of-week (year self) (month self)
                                                    day))
                                     days-of-month)))
          (setf (column self 'day) days-of-month
                (column self 'day-of-week) days-of-week)))
    #+END_SRC
    Now, we can generate a yearly calendar.  The meta-data slots are
    available as keyword arguments to =make-table=
    #+BEGIN_SRC lisp
      (setf *calendar*
	    (mapcar (lambda (month)
		      (make-table 'calendar :year 2013 :month month))
		    '(0 1 2 3 4 5 6 7 8 9 10 11)))
    #+END_SRC
    And we can query what day of the week is on September 30th:
    #+BEGIN_SRC lisp
      (select (eighth *calendar*)
	      :column 'day-of-week
	      :where (matching-row (eightht *calendar*)
				   (day 30)))
    #+END_SRC
    
*** Table inheritance

    Table definitions can make use of inheritance.  The example on the
    plane route can be generalized using a base class of route
    #+BEGIN_SRC lisp
	  (deftable route ()
	    (time)
	    (coordinates)
	    (speed)
	    (bearing))
    #+END_SRC

    Now, specializing to planes
    #+BEGIN_SRC lisp
      (deftable plane-route (route)
       	((altitude)
	 (radar)
	 (wind)))   
    #+END_SRC
    And to a ship route
    #+BEGIN_SRC lisp
      (deftable ship-route (route)
       	((wave-height)
	 (current)
	 (officer-on-deck)))    
    #+END_SRC

** Accessing table contents
   
*** Low level/developer methods

    Mimicking =slot-value=, setf-able methods =column-values= and
    =row-values= give access to the raw contents of a column or row.
    The values are passed as a list, vector or structure.  The special
    variable  =*raw-container-type*= signals type of container when
    retrieving the values.

    =value= gives access to a cell value.

    These methods perform no checking or conversion as specified in
    the table schema.  

    Unlike the higher level methods, column/row values can be accessed
    by the column/row index.

*** High level/user access methods
    Higher level access is provided with column, row, and table value
    accessors.  These return an object that can be queried for its
    values, or into which a value can be placed.  Value retrieval or
    setting triggers all the type and value checking specifications of
    the table schema.

    Both column and row accessors support the =export= generic
    function.  It will return a sequence of values in the specified
    format (list, vector, or structure for rows).

**** Row accessor
     The function =select-row= returns the row accessor for the first
     row that satisfies the /predicate function/
     #+BEGIN_SRC lisp
           (setf row-accessor (select-row table predicate-function))
     #+END_SRC
     The /predicate function/ tests the row against it contents or its
     index, or both.

     *Note:* What name is better: =select-row= or =table-row=?

     One can access or setf the row data using =value=
     #+BEGIN_SRC lisp
           (value row-accessor column-name)
     #+END_SRC
     Finally, one can export the row into a CL sequence
     #+BEGIN_SRC lisp
           (export row-accessor &optional (type :list))
     #+END_SRC
     Export can be one of list, vector, structure (tagged with column
     names) or even foreign-vector (if the row data-type is
     appropriate).

     Row-accessor supports the concept of a row index using the
     =row-index= function.  This is a setf-able quantity, allowing us
     to use a row-accessor to accesses any table row.

**** Iterating over rows
     Row iteration is done using the =do-rows= macro or modifying a
     row-accessor's row-index.


