documentation/user-doc/mv-table-user-documentation.html
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Table initialization via initforms and initiargs</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
We can use initforms and initargs to build a table of sines
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable sin-table ()
  ((x :storage array
      :element-type 'float
      :initform '(range 0 pi 21))
   (y :storage array
      :element-type 'float
      :initform '(sin x)))
  (:documentation "Table of the sin function"))
</pre>
</div>
<p>
The x column can be initialized either via make-table or using
the :default-initargs definition in <code>deftable</code>
</p>

<p>
We get a table of 21 values of sin between 0 and 2π with:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(make-table 'sin-table)
</pre>
</div>

<p>
Of course, the following works as well:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(make-instance 'sin-table :x (range 0 1d0 51))
</pre>
</div>
<p>
Now we have a table of 51 values of <code>sin</code>.
</p>

<p>
How does this work?  Because we specified the value of column x,
the table build method is <code>column</code>.  This allows us to setf values
of the y column.
</p>

<p>
Note that if we change the values of <code>x</code>, the values of <code>y</code> will
not be automatically updated.  For that, we will have to re-derive
<code>y</code> explicitly.  Tables have no intelligence or knowledge of data
dependency.  That has to be added by the user code.
</p>


<p>
Table contents can be derived from other tables:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable derived ()
  ((sum :storage array
	:element-type 'float)))

(defmethod initialize-instance :after ((self derived) &amp;key t1 t2
							&amp;allow-other-keys)
  (setf (column self 'sum)
	(map-rows (lambda (row-t1 row-t2)
		    (+ (column-value row-t1 'A)
		       (column-value row-t2 'B)))
		  t1 t2)))
</pre>
</div>
<p>
This object initializes the <code>sum</code> column using values of
columns A and B from tables t1 and t2 respectively.
</p>


<p>
A final example of a table initialization involves table
meta-data.  We define a table that will compute the calendar for a
month.  The year and month are stored as the :meta-data table
options.  Their values are available in the <code>initialize-instance</code>
<code>:after</code> method.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable calendar ()
  ((day)
   (day-of-week))
  (:meta-data
   :year
   :month))

(defmethod initialize-instance :after ((self calendar) &amp;key
				       &amp;allow-other-keys)
  (let* ((days-of-month (days-of-month (year self) (month self)))
	 (days-of-week (mapcar (lambda (day)
				 (day-of-week (year self) (month self)
					      day))
			       days-of-month)))
    (setf (column self 'day) days-of-month
	  (column self 'day-of-week) days-of-week)))
</pre>
</div>
<p>
Now, we can generate a yearly calendar.  The meta-data slots are
available as keyword arguments to <code>make-table</code>
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf *calendar*
      (mapcar (lambda (month)
		(make-table 'calendar :year 2013 :month month))
	      '(0 1 2 3 4 5 6 7 8 9 10 11)))
</pre>
</div>
<p>
And we can query what day of the week is on September 30th:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(select (eighth *calendar*)
	:column 'day-of-week
	:where (matching-row (eightht *calendar*)
			     (day 30)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Table inheritance</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Table definitions can make use of inheritance.  The example on the
plane route can be generalized using a base class of route
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable route ()
  (time)
  (coordinates)
  (speed)
  (bearing))
</pre>
</div>

<p>
Now, specializing to planes
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable plane-route (route)
  ((altitude)
   (radar)
   (wind)))
</pre>
</div>
<p>
And to a ship route
</p>
<div class="org-src-container">

<pre class="src src-lisp">(deftable ship-route (route)
  ((wave-height)
   (current)
   (officer-on-deck)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Accessing table contents</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Low level/developer methods</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Mimicking <code>slot-value</code>, setf-able methods <code>column-values</code> and
<code>row-values</code> give access to the raw contents of a column or row.
The values are passed as a list, vector or structure.  The special
variable  <code>*raw-container-type*</code> signals type of container when
retrieving the values.
</p>

<p>
<code>value</code> gives access to a cell value.
</p>

<p>
These methods perform no checking or conversion as specified in
the table schema.  
</p>

<p>
Unlike the higher level methods, column/row values can be accessed
by the column/row index.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> High level/user access methods</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Higher level access is provided with column, row, and table value
accessors.  These return an object that can be queried for its
values, or into which a value can be placed.  Value retrieval or
setting triggers all the type and value checking specifications of
the table schema.
</p>

<p>
Both column and row accessors support the <code>export</code> generic
function.  It will return a sequence of values in the specified
format (list, vector, or structure for rows).
</p>
</div>

<ol class="org-ol"><li>Row accessor<br  /><div class="outline-text-5" id="text-3-2-2-1">
<p>
The function <code>select-row</code> returns the row accessor for the first
row that satisfies the <i>predicate function</i>
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf row-accessor (select-row table predicate-function))
</pre>
</div>
<p>
The <i>predicate function</i> tests the row against it contents or its
index, or both.
</p>

<p>
<b>Note:</b> What name is better: <code>select-row</code> or <code>table-row</code>?
</p>

<p>
One can access or setf the row data using <code>value</code>
</p>
<div class="org-src-container">

<pre class="src src-lisp">(value row-accessor column-name)
</pre>
</div>
<p>
Finally, one can export the row into a CL sequence
</p>
<div class="org-src-container">

<pre class="src src-lisp">(export row-accessor &amp;optional (type :list))
</pre>
</div>
<p>
Export can be one of list, vector, structure (tagged with column
names) or even foreign-vector (if the row data-type is
appropriate).
</p>

<p>
Row-accessor supports the concept of a row index using the
<code>row-index</code> function.  This is a setf-able quantity, allowing us
to use a row-accessor to accesses any table row.
</p>
</div>
</li>
<li>Iterating over rows<br  /><div class="outline-text-5" id="text-3-2-2-2">
<p>
Row iteration is done using the <code>do-rows</code> macro or modifying a
row-accessor's row-index.
</p>
</div>
</li></ol>
</div>
