doc/user-doc/mv-table-user-documentation.org
*** Column accessor
    A column is accessed using the column accessor defined in
    =deftable= column schema.  This accessor returns the column
    accessor object.  Thus for a table =calendar= with a =month=
    column, the following returns =month='s column accessor
    #+BEGIN_SRC lisp
      (month calendar)
    #+END_SRC

    Column data is accessed using the same generic function =value=
    and either the row index or a predicate function.  The predicate
    function will search the table for the matching row, and return
    that row's column value.
    #+BEGIN_SRC lisp
          (value column-accessor row-matcher)
    #+END_SRC
    =row-matcher= is either a row index or a function that returns
    true on a table row.

**** Iterating over columns
     The macro =do-columns= will iterate over columns.  The iteration
     order is unspecified - it is unrelated to the order of columns in
     the table schema.
     
     
*** Table saving and loading
    Tables are serializable: they can be saved into a file and loaded
    in a later CL session.
    #+BEGIN_SRC lisp
      (save-table stream table)
      (load-table stream)
    #+END_SRC
** Selecting parts of a table
   *Note*: We use SQL-like syntax for table queries.  This is
   motivated by Chapter 27 of Practical Common Lisp.  
   
   From a table we can derive another table with a sub set of columns
   or rows.  This is done with the ~select~ command.  For example,
   here we get a new table with the time and altitude data while the
   flight was under JFK's airport control (with apologies to the
   correct nomenclature)
   #+BEGIN_SRC lisp
     (select flight-xyz :columns '(time altitude)
	     :where (matching flight-xyz (= control-tower "JKF")))
   #+END_SRC
   
** Generic functions and methods: From tables to tables and/or statistics

   A table can be derived from values in one or more tables.  We can
   also obtain one or more summaries of a table data, i.e., statistics.
   This is done with functions and methods whose arguments are tables.

   

**** Table statistics
     Consider the following generic function definition
     #+BEGIN_SRC lisp
       (defgeneric column-max (table &optional columns)
         (:documentation
       "Return an a-list of column names and their maximum values
       
       If columns is specified, return maxima for those columns.  If
       columns is t (the default value), return maxima for all columns.
       If columns is nil, return nil"))
     #+END_SRC
     Now we can define methods on various table types to provide this
     functionality.
     
*** Writing methods with tables

    To be done

* Dictionary
  Parts of this dictionary is based on Practical Common Lisp, Chapter
  27 (PCL27).  I have initially copied the list of exported symbols of
  PCL27.  Not all of them may be necessary for the MOP-based
  implementation.
** Table definition and instantiation
*** /macro/ ~deftable~
    :PROPERTIES:
    :ID:       sl0b63s038g0
    :END:
**** Syntax
     *deftable* table-name ({supertable-name}*) ({column-specifier}*)
     [{}[table-option]{}] \rightarrow new-table
     
     - column-specifier :: column-name | (column-name [{}[column-options]{}])
     - column-name :: symbol
     - column-option :: 
       - {:initarg initarg-name} |
       - {:initform column-initform} |
       - {:type type-specifier} |
       - {:documentation string}
       - {:storage symbol} |
       - {:action symbol} |
       - {:value-normalizer lambda-form} |
       - {:equality-predicate function | lambda-form } |
       - {:comparator function | lambda-form} |
       - {:null-value symbol | number | string} |
       - {:default-value valid-table-entry}
       - {:lazy-p boolean}
     - table-option ::
       - {:default-initargs . column-initargs} |
       - {:depends-on parent-table-list} |
       - {:documentation . string} |
       - {:type symbol} |
       - {:layout symbol} |
       - {:storage symbol} |
       - {:access symbol}
       - {:action symbol} |
       - {:row-count number} |
       - {:max-row-count number} |
       - {:min-row-count number}
     - table-meta-data ::
       - {:source path | string | symbol} |
       - {:author string} |
       - {keyword | (keyword [type & (:documentation string)])}*


**** Arguments and values
     - table-name :: a non-nil symbol
     - supertable-name  :: a non-nil symbol
     - column-name :: a symbol
     - initarg :: a symbol
     - column-initargs :: a list of column names and initialization
          values
     - column-initform :: A form that is evaluated for each column row
          to initialize contents
     - parent-table-list :: A list of symbols, naming the tables that
          column initforms will use
     - type-specifier :: a CL type specifier

**** Description
     Defines a table schema.  Table option =:type= specifies the table
     to be of column, square (default), or matrix type.  Not all
     column and table options are compatible with all table types.

     Unlike many options, the table type cannot be overridden with
     =make-table=.

