documentation/user-doc/mv-table-user-documentation.html

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Column accessor</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
A column is accessed using the column accessor defined in
<code>deftable</code> column schema.  This accessor returns the column
accessor object.  Thus for a table <code>calendar</code> with a <code>month</code>
column, the following returns <code>month</code>'s column accessor
</p>
<div class="org-src-container">

<pre class="src src-lisp">(month calendar)
</pre>
</div>

<p>
Column data is accessed using the same generic function <code>value</code>
and either the row index or a predicate function.  The predicate
function will search the table for the matching row, and return
that row's column value.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(value column-accessor row-matcher)
</pre>
</div>
<p>
<code>row-matcher</code> is either a row index or a function that returns
true on a table row.
</p>
</div>

<ol class="org-ol"><li>Iterating over columns<br  /><div class="outline-text-5" id="text-3-2-3-1">
<p>
The macro <code>do-columns</code> will iterate over columns.  The iteration
order is unspecified - it is unrelated to the order of columns in
the table schema.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> Table saving and loading</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Tables are serializable: they can be saved into a file and loaded
in a later CL session.
</p>
<div class="org-src-container">

<pre class="src src-lisp">(save-table stream table)
(load-table stream)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Selecting parts of a table</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>Note</b>: We use SQL-like syntax for table queries.  This is
motivated by Chapter 27 of Practical Common Lisp.  
</p>

<p>
From a table we can derive another table with a sub set of columns
or rows.  This is done with the <code>select</code> command.  For example,
here we get a new table with the time and altitude data while the
flight was under JFK's airport control (with apologies to the
correct nomenclature)
</p>
<div class="org-src-container">

<pre class="src src-lisp">(select flight-xyz :columns '(time altitude)
	:where (matching flight-xyz (= control-tower "JKF")))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Generic functions and methods: From tables to tables and/or statistics</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A table can be derived from values in one or more tables.  We can
also obtain one or more summaries of a table data, i.e., statistics.
This is done with functions and methods whose arguments are tables.
</p>
</div>



<ol class="org-ol"><li>Table statistics<br  /><div class="outline-text-5" id="text-3-4-0-1">
<p>
Consider the following generic function definition
</p>
<div class="org-src-container">

<pre class="src src-lisp">(defgeneric column-max (table &amp;optional columns)
  (:documentation
"Return an a-list of column names and their maximum values

If columns is specified, return maxima for those columns.  If
columns is t (the default value), return maxima for all columns.
If columns is nil, return nil"))
</pre>
</div>
<p>
Now we can define methods on various table types to provide this
functionality.
</p>
</div>
</li>
<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Writing methods with tables</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
To be done
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dictionary</h2>
<div class="outline-text-2" id="text-4">
<p>
Parts of this dictionary is based on Practical Common Lisp, Chapter
27 (PCL27).  I have initially copied the list of exported symbols of
PCL27.  Not all of them may be necessary for the MOP-based
implementation.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Table definition and instantiation</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><a id="sl0b63s038g0" name="sl0b63s038g0"></a><span class="section-number-4">4.1.1</span> <i>macro</i> <code>deftable</code></h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
<ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-1-1-1">
<p>
<b>deftable</b> table-name ({supertable-name}*) ({column-specifier}*)
[{}[table-option]{}] &rarr; new-table
</p>

<dl class="org-dl">
<dt> column-specifier </dt><dd>column-name | (column-name [{}[column-options]{}])
</dd>
<dt> column-name </dt><dd>symbol
</dd>
<dt> column-option </dt><dd><ul class="org-ul">
<li>{:initarg initarg-name} |
</li>
<li>{:initform column-initform} |
</li>
<li>{:type type-specifier} |
</li>
<li>{:documentation string}
</li>
<li>{:storage symbol} |
</li>
<li>{:action symbol} |
</li>
<li>{:value-normalizer lambda-form} |
</li>
<li>{:equality-predicate function | lambda-form } |
</li>
<li>{:comparator function | lambda-form} |
</li>
<li>{:null-value symbol | number | string} |
</li>
<li>{:default-value valid-table-entry}
</li>
<li>{:lazy-p boolean}
</li>
</ul>
</dd>
<dt> table-option </dt><dd><ul class="org-ul">
<li>{:default-initargs . column-initargs} |
</li>
<li>{:depends-on parent-table-list} |
</li>
<li>{:documentation . string} |
</li>
<li>{:type symbol} |
</li>
<li>{:layout symbol} |
</li>
<li>{:storage symbol} |
</li>
<li>{:access symbol}
</li>
<li>{:action symbol} |
</li>
<li>{:row-count number} |
</li>
<li>{:max-row-count number} |
</li>
<li>{:min-row-count number}
</li>
</ul>
</dd>
<dt> table-meta-data </dt><dd><ul class="org-ul">
<li>{:source path | string | symbol} |
</li>
<li>{:author string} |
</li>
<li>{keyword | (keyword [type &amp; (:documentation string)])}*
</li>
</ul>
</dd>
</dl>
</div>
</li>

<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-1-1-2">
<dl class="org-dl">
<dt> table-name </dt><dd>a non-nil symbol
</dd>
<dt> supertable-name  </dt><dd>a non-nil symbol
</dd>
<dt> column-name </dt><dd>a symbol
</dd>
<dt> initarg </dt><dd>a symbol
</dd>
<dt> column-initargs </dt><dd>a list of column names and initialization
values
</dd>
<dt> column-initform </dt><dd>A form that is evaluated for each column row
to initialize contents
</dd>
<dt> parent-table-list </dt><dd>A list of symbols, naming the tables that
column initforms will use
</dd>
<dt> type-specifier </dt><dd>a CL type specifier
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-1-1-3">
<p>
Defines a table schema.  Table option <code>:type</code> specifies the table
to be of column, square (default), or matrix type.  Not all
column and table options are compatible with all table types.
</p>

<p>
Unlike many options, the table type cannot be overridden with
<code>make-table</code>.
</p>
</div>

<ol class="org-ol"><li>Table options<br  /><div class="outline-text-6" id="text-4-1-1-3-1">
<p>
