doc/user-doc/mv-table-user-documentation.org
***** Table options
      :PROPERTIES:
      :ID:       snta4tm09gg0
      :END:

      Table =:type= is one of =:column=, =:square= (default), or
      =:matrix=.  See [[id:wu17np515gg0][Table types]] for discussion of table types.

      Table =:layout= is used for =:square= and =:matrix= tables.  It
      specifies the table layout in memory.  The layout can be either
      =:column= or =:matrix=.  It does not impact table functionality
      but can impact access efficiency.

      Table =:storage= is =:file=, =:memory= (default), or
      =:external=.  This last one implies the data is stored by an
      external application such as a database.

      Table =:access= is one of =:random= or =:sequential=.  =:random=
      access allows any element, row, or column to be accessed in any
      order.  =:sequential= tables access only one row at a time, from
      the table top to bottom.

      =:file= tables support only =:sequential= access.  =:memory=
      tables can support =:sequential= access, but that is not
      customary or necessary.

      =:action= specifies the types of action on table contents.
      Tables can be =:read-only=, =:write-only=, or =:read/write=
      (default).

      =:file= tables support one =:read-only= or =:write-only=.  For a
      =:read-only table=, the generic function =insert-row=
      =:read-only= table will read a record from the associated file
      and make it available with a row-accessor.  For a =:write-only=
      table, =insert-row= will place the next row contents into the
      next record of the specified file.  See [[id:cvj8u6002gg0][File based tables]] for
      more details.

      Parent tables, declared via =:depends-on=, and supplied with
      =make-table= must be of the same length.  These tables determine
      the table row count.

****** Row count options

       The =:row-count=, =:min-row-count=, =:max-row-count= play a
       mixed role.  Some examples are given in the following.

       If a table depends on other tables, =row-count= is derived from
       the parent tables (all of which must be of same length,
       otherwise, the results are undefined).

       =row-count= is initially nil.  It is set to non-nil by one of
       the following:
       - inserting a table row sets it to 1
	 - Note: Further inserting of table rows increments =row-count=
       - inserting the first column

	 
       In a table that is defined by inserting rows, =row-count= is a
       status variable.  But when inserting a table column, the column
       must equal the table's =row-count=

***** Column options
      Columns are initialized using =:initarg= slot and
      =:default-initargs= table options.  The =initialize-instance=
      =:after= method has access to all the initialized columns, and
      can initialize other columns.

      Column =:type= is specified with the =:type= column option.
      This is only a specification.  It may or may not be enforced by
      the writer methods.

      For tables with =:column= organization, =:storage= specifies the
      CL data structure that stores the data.  It can be one of
      =:list= =:vector= =:foreign-vector=.

      The =:value-normalizer= function can be used for normalizing the
      data for efficient storage, and in a form appropriate for the
      comparison functions.

      The =:comparator= and =:equality-predicate= functions are used
      to compare column entries for sorting and equality purposes.

      =:null-value= is used to specify a value which when stored
      signals that the value has not been set yet.  Using
      =:null-value= is optional.  Specifying it allows for some space
      and speed savings.  Otherwise, the table keeps additional
      storage with flags for set and unset cells.  A cell is set to
      null with a call =(setf (cell reference) +null+)=

      =:default-value= is the value returned, if the =:null-value= has
      not been set.

      =:lazy-p= boolean signals that the column values can be computed
      only when the actual value is requested.

      Columns in an in =:memory= table can support all of =:read-only=
      =:write-only= or =:read/write= actions.  The actions can be
      changed while the table is in existence. 

***** Table (column) initialization via =initform=
      Column =initform= is a form that is evaluated in a null lexical
      environment.  It initializes the column contents.  It has access
      to all of table's columns, and to contents of the parent tables
      (see syntax below)

      The syntax is as follows
      #+BEGIN_SRC lisp
        (with-column-readers (&rest symbol+accessor-form-pairs)
          body)
      #+END_SRC
      where =symbol+accessor-form-pairs= is a list of a symbol that is
      used to reference a column (the accessor-form).  The accessor
      form is either a symbol, referring to a column in the current
      table, or a list =(column-name table-name)= with the
      =column-name= referring to a column from table =table-name=,
      =table-name= being one of parent tables declared with the
      =:depends-on= table option.

****** Implementation note:
       For =initform= to function properly, the following must be
       satisfied:
       - =initform= is evaluated in lazy-mode, only when requested
       - =initform=s should not form a circular dependency
       - =initform= may depend on columns without =initform=.   It is
         the users responsibility that all non-=initform= columns have
         values assigned, via =initarg= or =default-initarg=
       - parent tables must be of same length.
       

***** Table inheritance
      A table can be defined to inherit the table schema and options
      from one or more tables.  The general rule is that the most
      specific option is inherited.  In case of incompatible options,
      the wining option is from the table that is ahead in the
      inheritance list.

****** Table options inheritance
       Currently not specified
       

****** Column option inheritance
       Currently not specified

