documentation/user-doc/mv-table-user-documentation.html
Table <code>:type</code> is one of <code>:column</code>, <code>:square</code> (default), or
<code>:matrix</code>.  See <a href="#sec-1-2">Table types</a> for discussion of table types.
</p>

<p>
Table <code>:layout</code> is used for <code>:square</code> and <code>:matrix</code> tables.  It
specifies the table layout in memory.  The layout can be either
<code>:column</code> or <code>:matrix</code>.  It does not impact table functionality
but can impact access efficiency.
</p>

<p>
Table <code>:storage</code> is <code>:file</code>, <code>:memory</code> (default), or
<code>:external</code>.  This last one implies the data is stored by an
external application such as a database.
</p>

<p>
Table <code>:access</code> is one of <code>:random</code> or <code>:sequential</code>.  <code>:random</code>
access allows any element, row, or column to be accessed in any
order.  <code>:sequential</code> tables access only one row at a time, from
the table top to bottom.
</p>

<p>
<code>:file</code> tables support only <code>:sequential</code> access.  <code>:memory</code>
tables can support <code>:sequential</code> access, but that is not
customary or necessary.
</p>

<p>
<code>:action</code> specifies the types of action on table contents.
Tables can be <code>:read-only</code>, <code>:write-only</code>, or <code>:read/write</code>
(default).
</p>

<p>
<code>:file</code> tables support one <code>:read-only</code> or <code>:write-only</code>.  For a
<code>:read-only table</code>, the generic function <code>insert-row</code>
<code>:read-only</code> table will read a record from the associated file
and make it available with a row-accessor.  For a <code>:write-only</code>
table, <code>insert-row</code> will place the next row contents into the
next record of the specified file.  See <a href="#sec-1-4">File based tables</a> for
more details.
</p>

<p>
Parent tables, declared via <code>:depends-on</code>, and supplied with
<code>make-table</code> must be of the same length.  These tables determine
the table row count.
</p>
</div>

<ol class="org-ol"><li>Row count options<br  /><div class="outline-text-7" id="text-4-1-1-3-1-1">
<p>
The <code>:row-count</code>, <code>:min-row-count</code>, <code>:max-row-count</code> play a
mixed role.  Some examples are given in the following.
</p>

<p>
If a table depends on other tables, <code>row-count</code> is derived from
the parent tables (all of which must be of same length,
otherwise, the results are undefined).
</p>

<p>
<code>row-count</code> is initially nil.  It is set to non-nil by one of
the following:
</p>
<ul class="org-ul">
<li>inserting a table row sets it to 1
<ul class="org-ul">
<li>Note: Further inserting of table rows increments <code>row-count</code>
</li>
</ul>
</li>
<li>inserting the first column
</li>
</ul>


<p>
In a table that is defined by inserting rows, <code>row-count</code> is a
status variable.  But when inserting a table column, the column
must equal the table's <code>row-count</code>
</p>
</div>
</li></ol>
</li>
<li>Column options<br  /><div class="outline-text-6" id="text-4-1-1-3-2">
<p>
Columns are initialized using <code>:initarg</code> slot and
<code>:default-initargs</code> table options.  The <code>initialize-instance</code>
<code>:after</code> method has access to all the initialized columns, and
can initialize other columns.
</p>

<p>
Column <code>:type</code> is specified with the <code>:type</code> column option.
This is only a specification.  It may or may not be enforced by
the writer methods.
</p>

<p>
For tables with <code>:column</code> organization, <code>:storage</code> specifies the
CL data structure that stores the data.  It can be one of
<code>:list</code> <code>:vector</code> <code>:foreign-vector</code>.
</p>

<p>
The <code>:value-normalizer</code> function can be used for normalizing the
data for efficient storage, and in a form appropriate for the
comparison functions.
</p>

<p>
The <code>:comparator</code> and <code>:equality-predicate</code> functions are used
to compare column entries for sorting and equality purposes.
</p>

<p>
<code>:null-value</code> is used to specify a value which when stored
signals that the value has not been set yet.  Using
<code>:null-value</code> is optional.  Specifying it allows for some space
and speed savings.  Otherwise, the table keeps additional
storage with flags for set and unset cells.  A cell is set to
null with a call <code>(setf (cell reference) +null+)</code>
</p>

<p>
<code>:default-value</code> is the value returned, if the <code>:null-value</code> has
not been set.
</p>

<p>
<code>:lazy-p</code> boolean signals that the column values can be computed
only when the actual value is requested.
</p>

<p>
Columns in an in <code>:memory</code> table can support all of <code>:read-only</code>
<code>:write-only</code> or <code>:read/write</code> actions.  The actions can be
changed while the table is in existence. 
</p>
</div>
</li>
<li>Table (column) initialization via <code>initform</code><br  /><div class="outline-text-6" id="text-4-1-1-3-3">
<p>
Column <code>initform</code> is a form that is evaluated in a null lexical
environment.  It initializes the column contents.  It has access
to all of table's columns, and to contents of the parent tables
(see syntax below)
</p>

<p>
The syntax is as follows
</p>
<div class="org-src-container">

<pre class="src src-lisp">(with-column-readers (&amp;rest symbol+accessor-form-pairs)
  body)
</pre>
</div>
<p>
where <code>symbol+accessor-form-pairs</code> is a list of a symbol that is
used to reference a column (the accessor-form).  The accessor
form is either a symbol, referring to a column in the current
table, or a list <code>(column-name table-name)</code> with the
<code>column-name</code> referring to a column from table <code>table-name</code>,
<code>table-name</code> being one of parent tables declared with the
<code>:depends-on</code> table option.
</p>
</div>

<ol class="org-ol"><li>Implementation note:<br  /><div class="outline-text-7" id="text-4-1-1-3-3-1">
<p>
For <code>initform</code> to function properly, the following must be
satisfied:
</p>
<ul class="org-ul">
<li><code>initform</code> is evaluated in lazy-mode, only when requested
</li>
<li>=initform=s should not form a circular dependency
</li>
<li><code>initform</code> may depend on columns without <code>initform</code>.   It is
the users responsibility that all non-=initform= columns have
values assigned, via <code>initarg</code> or <code>default-initarg</code>
</li>
<li>parent tables must be of same length.
</li>
</ul>
</div>
</li></ol>
</li>

<li>Table inheritance<br  /><div class="outline-text-6" id="text-4-1-1-3-4">
<p>
A table can be defined to inherit the table schema and options
from one or more tables.  The general rule is that the most
specific option is inherited.  In case of incompatible options,
the wining option is from the table that is ahead in the
inheritance list.
</p>
</div>

<ol class="org-ol"><li>Table options inheritance<br  /><div class="outline-text-7" id="text-4-1-1-3-4-1">
<p>
Currently not specified
</p>
</div>
</li>

<li>Column option inheritance<br  /><div class="outline-text-7" id="text-4-1-1-3-4-2">
<p>
Currently not specified
</p>
</div>
