doc/user-doc/mv-table-user-documentation.org
******* Old draft of column option inheritance
       	The rules of table inheritance are as follows:
       	- The new table inherits the columns from parent tables
       	- If there is a conflict in the parent tables on a column
       	  definition, the following applies:
       	  - ~storage~ :: The most specific type is applied.  Furthermore,
                       	 if the column definition specifies ~storage~, it
                       	 must be as or more specific than from the
                       	 inherited arrays
       	  - ~element type~ :: The most specific element type is applied.
                              If the element type is specified, it must
                              be subtype of element types of the
                              inherited.
       	  - ~initform~ :: If it is specified, it overrides the initforms
                       	  of the supertables.  If unspecified, the
                       	  initform of the most specific supertable
                       	  applies
       	- ~init-tables~ .  If unspecified, it is a union of init-tables of
       	  the super-tables and the tables specified by ~init-tables~.
       	- For all other properties, the usual class precedence rule apply

*** /Function/ ~make-table~

**** Description
     Makes an instance of a new table.  One can specify table options
     and initialize the table contents.

***** Specifying the table options
      It is not specified whether tables support overriding table
      options (=:type=, =:organization=, =:storage=, =:access=,
      =:action=) via keywords.  It is not clear whether the additional
      flexibility is worth the implementation effort Keywords
      correspond to the table options available in =deftable=.  The
      keywords override the =deftable= specification.

       
***** Initializing table contents
      The contents of individual columns are initialized by
      their :keyworded names as initargs.  This sets the table
      to :column-wise loading.

      row-wise loading can be accomplished via the
      =initialize-instance= =:after= method.
       
*** /Macro/ defcolumn

**** Note:
     I am not sure this is a necessary function as columns will be
     defined in [[id:sl0b63s038g0][~deftable~]]

**** Description
     Defines a column schema(PCL27)

*** /Function/ not-nullable

**** Description
     A value normalizer function that signals an error if a ~null~
     value is submitted.
*** /Function/ extract-schema

    
**** Description
     Returns a subset of the table's column schemas as a list of slot
     definitions.
     
*** /Function/ schema

**** Description
     Returns the table's schema as a list of slot definitions.

*** /Generic Function/ update-instance-for-redefined-table
    Not specified yet

** Table queries
*** /Function/ *in*
    
**** Note:
     Modeled after the specifications in Ch. 27 of PCL

**** Syntax
     *in* column-name table → function

**** Arguments and values
     - column-name :: a symbol
     - table :: a square table
     - function :: Function of one argument, a table row.  It returns
                   true if the column value in a set of values stored
                   in the table under that same name

**** Description
     PCL27:
     #+BEGIN_QUOTE
     Returns a function that matches rows where a particular column is
     in a given set of values.
     #+END_QUOTE
     
*** /Function/ *select*

**** Note:
     Modeled after the specifications in Ch. 27 of PCL

**** Syntax
     *select* table &key (columns t) where distinct ordered from-end → new-table
     
**** Arguments and values
     - table :: a square table
     - columns :: =t= or a list of column names that will be transferred
                  to the /new-table/
     - where :: a function that accepts a row as an argument and
                returns true if it should be accepted in the new table
     - distinct :: if =t=, eliminate duplicate rows from the result
                   by testing all columns for equality.  If a list,
                   test only specified columns.  See below for
                   detailed explanation.
     - ordered :: if =t= sort using sorting specifications of all
                  columns.  Else a list that specifies columns used
                  for sorting.  See below for detailed explanation.
     - from-end :: Perform the row search or sorting from the table
                   end
     - new-table :: A new table
       
**** Description
     Returns a sub-range of a table.  The table contents are based on
     /columns/, /where/, /distinct/, and /from-end/.  The ordering of
     the table is based on /columns/, /order-by/, and /from-end/.

     - columns :: If =t=, all columns are transferred.  Otherwise only
                  listed columns are transferred
		  
		  
     Row sorting is done by using the column comparator and equality
     predicates.  If multiple columns are used for comparison, row
     comparison is done by considering columns left-to-right (this
     ordering can be overridden), using the latter columns to break
     ties from comparisons of earlier columns.  If the final test is
     =equal=, the first row is accepted.

