documentation/user-doc/mv-table-user-documentation.html

<ol class="org-ol"><li>Old draft of column option inheritance<br  /><div class="outline-text-8" id="text-4-1-1-3-4-2-1">
<p>
The rules of table inheritance are as follows:
</p>
<ul class="org-ul">
<li>The new table inherits the columns from parent tables
</li>
<li>If there is a conflict in the parent tables on a column
definition, the following applies:
<dl class="org-dl">
<dt> <code>storage</code> </dt><dd>The most specific type is applied.  Furthermore,
if the column definition specifies <code>storage</code>, it
must be as or more specific than from the
inherited arrays
</dd>
<dt> <code>element type</code> </dt><dd>The most specific element type is applied.
If the element type is specified, it must
be subtype of element types of the
inherited.
</dd>
<dt> <code>initform</code> </dt><dd>If it is specified, it overrides the initforms
of the supertables.  If unspecified, the
initform of the most specific supertable
applies
</dd>
</dl>
</li>
<li><code>init-tables</code> .  If unspecified, it is a union of init-tables of
the super-tables and the tables specified by <code>init-tables</code>.
</li>
<li>For all other properties, the usual class precedence rule apply
</li>
</ul>
</div>
</li></ol>
</li></ol>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> <i>Function</i> <code>make-table</code></h4>
<div class="outline-text-4" id="text-4-1-2">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-1-2-1">
<p>
Makes an instance of a new table.  One can specify table options
and initialize the table contents.
</p>
</div>

<ol class="org-ol"><li>Specifying the table options<br  /><div class="outline-text-6" id="text-4-1-2-1-1">
<p>
It is not specified whether tables support overriding table
options (<code>:type</code>, <code>:organization</code>, <code>:storage</code>, <code>:access</code>,
<code>:action</code>) via keywords.  It is not clear whether the additional
flexibility is worth the implementation effort Keywords
correspond to the table options available in <code>deftable</code>.  The
keywords override the <code>deftable</code> specification.
</p>
</div>
</li>

<li>Initializing table contents<br  /><div class="outline-text-6" id="text-4-1-2-1-2">
<p>
The contents of individual columns are initialized by
their :keyworded names as initargs.  This sets the table
to :column-wise loading.
</p>

<p>
row-wise loading can be accomplished via the
<code>initialize-instance</code> <code>:after</code> method.
</p>
</div>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> <i>Macro</i> defcolumn</h4>
<div class="outline-text-4" id="text-4-1-3">
</div><ol class="org-ol"><li>Note:<br  /><div class="outline-text-5" id="text-4-1-3-1">
<p>
I am not sure this is a necessary function as columns will be
defined in <a href="#sec-4-1-1"><code>deftable</code></a>
</p>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-1-3-2">
<p>
Defines a column schema(PCL27)
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> <i>Function</i> not-nullable</h4>
<div class="outline-text-4" id="text-4-1-4">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-1-4-1">
<p>
A value normalizer function that signals an error if a <code>null</code>
value is submitted.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4">4.1.5</span> <i>Function</i> extract-schema</h4>
<div class="outline-text-4" id="text-4-1-5">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-1-5-1">
<p>
Returns a subset of the table's column schemas as a list of slot
definitions.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-1-6" class="outline-4">
<h4 id="sec-4-1-6"><span class="section-number-4">4.1.6</span> <i>Function</i> schema</h4>
<div class="outline-text-4" id="text-4-1-6">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-1-6-1">
<p>
Returns the table's schema as a list of slot definitions.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-1-7" class="outline-4">
<h4 id="sec-4-1-7"><span class="section-number-4">4.1.7</span> <i>Generic Function</i> update-instance-for-redefined-table</h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
Not specified yet
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Table queries</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> <i>Function</i> <b>in</b></h4>
<div class="outline-text-4" id="text-4-2-1">
</div><ol class="org-ol"><li>Note:<br  /><div class="outline-text-5" id="text-4-2-1-1">
<p>
Modeled after the specifications in Ch. 27 of PCL
</p>
</div>
</li>
<li>Syntax<br  /><div class="outline-text-5" id="text-4-2-1-2">
<p>
<b>in</b> column-name table → function
</p>
</div>
</li>
<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-2-1-3">
<dl class="org-dl">
<dt> column-name </dt><dd>a symbol
</dd>
<dt> table </dt><dd>a square table
</dd>
<dt> function </dt><dd>Function of one argument, a table row.  It returns
true if the column value in a set of values stored
in the table under that same name
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-2-1-4">
<p>
PCL27:
</p>
<blockquote>
<p>
Returns a function that matches rows where a particular column is
in a given set of values.
</p>
</blockquote>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> <i>Function</i> <b>select</b></h4>
<div class="outline-text-4" id="text-4-2-2">
</div><ol class="org-ol"><li>Note:<br  /><div class="outline-text-5" id="text-4-2-2-1">
<p>
Modeled after the specifications in Ch. 27 of PCL
</p>
</div>
</li>
<li>Syntax<br  /><div class="outline-text-5" id="text-4-2-2-2">
<p>
<b>select</b> table &amp;key (columns t) where distinct ordered from-end → new-table
</p>
</div>
</li>
<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-2-2-3">
<dl class="org-dl">
<dt> table </dt><dd>a square table
</dd>
<dt> columns </dt><dd><code>t</code> or a list of column names that will be transferred
to the <i>new-table</i>
</dd>
<dt> where </dt><dd>a function that accepts a row as an argument and
returns true if it should be accepted in the new table
</dd>
<dt> distinct </dt><dd>if <code>t</code>, eliminate duplicate rows from the result
by testing all columns for equality.  If a list,
test only specified columns.  See below for
detailed explanation.
</dd>
<dt> ordered </dt><dd>if <code>t</code> sort using sorting specifications of all
columns.  Else a list that specifies columns used
for sorting.  See below for detailed explanation.
</dd>
<dt> from-end </dt><dd>Perform the row search or sorting from the table
end
</dd>
<dt> new-table </dt><dd>A new table
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-2-2-4">
<p>
Returns a sub-range of a table.  The table contents are based on
<i>columns</i>, <i>where</i>, <i>distinct</i>, and <i>from-end</i>.  The ordering of
the table is based on <i>columns</i>, <i>order-by</i>, and <i>from-end</i>.
</p>

<dl class="org-dl">
<dt> columns </dt><dd>If <code>t</code>, all columns are transferred.  Otherwise only
listed columns are transferred
</dd>
</dl>


<p>
Row sorting is done by using the column comparator and equality
predicates.  If multiple columns are used for comparison, row
comparison is done by considering columns left-to-right (this
ordering can be overridden), using the latter columns to break
ties from comparisons of earlier columns.  If the final test is
<code>equal</code>, the first row is accepted.
</p>
</div>
