doc/user-doc/mv-table-user-documentation.org
***** Specifying tests for =:distinct= and =:ordered= keywords
      The argument for those two keyword can be =t=, in which case,
      the rows are compared based on contents of all columns using
      comparators in the table schema.

      If a list of column names is provided, then the comparison is
      done with only the contents of those columns.

      One can specify custom equality and comparison predicates for
      the search, overriding the default specified in the table
      schema.  This specified with a simplified with a limited lambda
      list of the form
      #+BEGIN_SRC lisp
        (column-name :comparator comparator-function
                     :equality-predicate equality-predicate-function)
      #+END_SRC
      =comparator-function= and =equality-predicate-function= are
      functions of two arguments that return a generalized boolean.

      To illustrate:
      #+BEGIN_SRC lisp
        (select table :ordered t) ;; sort using all columns and default comparators
        (select table :ordered 'column-a) ;; sort based on contents of column-a
        (select table :ordered '(column-a column-d)) ;; sort based on column-a, use column-d for tie-breakers
        (select table :ordered '((column-f #'string>)) ;; sort using #'string> on column-f
        (select table :ordered (list (list column-a (lambda (x y)
                                                      (> (abs x)
                                                         (sin y))))
                                     (list column-f #'string>)))
      #+END_SRC
      
		   
*** /Function/ matching
**** Syntax
     *matching* table &rest names-and-value-tests → row-matching-function
**** Arguments and values
     - table :: a square table
     - names-and-values :: list of name value-test pairs
     - row-matching-function :: a function of one argument, a table
          row accessor

**** Description
     Returns a function that matches rows with specific column values.
     /name-and-value-tests/ is a list of /name-and-value-test/ pairs.
     Each pair is a two element list.  The first element is a column
     name.  The second element is either a value or a function of one
     argument.

     The normalized value is compared using the column comparator
     against the column value of each row.  The function is called
     on the column value.  The function returns a generalized boolean
     which is used to determine whether the row satisfies the matching
     test.

     The name-and-value-tests are executed until the first pair fails,
     when the matching operation fails.
     
** Table operations
*** /Function/ delete-all-rows
**** Description
     Delete all table rows
*** /Function/ delete-rows

**** Description
     Delete rows that match a particular criteria
*** /Function/ insert-row
**** Description
     Insert data into the next table row
*** /Function-maybe/ column
**** Description
     Low level set-efable function that access the table column.  It
     bypasses sequence type checking.

*** /Function/ column-value
    
**** Description
     Low-level function set-efable  access to a cell value in a column.
     This function bypasses all type and value checking and
     normalization.
     
*** /Function/ sorted-rows
    

**** Description
     Sorts rows according to sorting criteria for the specified
     column names

** Access to table elements

*** /Function/ *advance-row*
    :PROPERTIES:
    :ID:       0wqhhju04gg0
    :END:

**** Calling convention
     *advance-row* row &optional index eot-error-p eot-value → row

**** Arguments and values
     - row :: a row accessor.
     - index :: a positive integer.  The default is 1.
     - eot-error-p :: a generalized boolean.  The default is true.
     - eot-value :: an object.  The default is nil

**** Description
     Increments row-index by the value of /index/.  If it tries to
     advance beyond the last row, it acts according to /eot-error-p/.

**** Exceptional Situations
     If /eof-table-p/ is true, *end-of-table* is signaled at the end
     of the table.
*** /Function/ =cell-value=
    
    *Note* function =cell-value= has been replaced by the generic
     function =value=
*** /Function/ =column-values=

**** Note
     Should I use a single generic function to access table values
     using either a table or a row accessor.

**** Syntax:
     /column-values/ table column-selector → /sequence/

**** Arguments and Values:
     - table :: a table
     - column-selector :: Column name or index
     - sequence :: A valid CL sequence

**** Description
     Returns a sequence of values stored in a column.  The sequence type
     is determined by =*raw-container-type*=

     If the selector fails to find a match, the correctable error
     =nonexistent-column= is thrown.
*** /Macro/ *do-rows*
**** Syntax
     *do-rows* (var table [result-form]) declaration* statement
**** Arguments and Values:
     - var :: a symbol
     - table :: a form that evaluates to a table
     - result-form :: if a /return/ or /return-from/ form is executed,
                      the values passed from that form; otherwise, the
                      values returned by the /result-form/ or nil if
                      there is no result-form.

**** Description
     iterate over rows of the table.  /var/ accesses a successive
     table rows.  
     
     For file-based read-only tables, the loop terminates at end of
     file.  For file-based write-only tables, the macro actions are
     unspecified.

     For all other tables, the loop terminates when the end of the
     table is reached.
*** /Macro/ *do-rows**
