documentation/user-doc/mv-table-user-documentation.html

<ol class="org-ol"><li>Specifying tests for <code>:distinct</code> and <code>:ordered</code> keywords<br  /><div class="outline-text-6" id="text-4-2-2-4-1">
<p>
The argument for those two keyword can be <code>t</code>, in which case,
the rows are compared based on contents of all columns using
comparators in the table schema.
</p>

<p>
If a list of column names is provided, then the comparison is
done with only the contents of those columns.
</p>

<p>
One can specify custom equality and comparison predicates for
the search, overriding the default specified in the table
schema.  This specified with a simplified with a limited lambda
list of the form
</p>
<div class="org-src-container">

<pre class="src src-lisp">(column-name :comparator comparator-function
	     :equality-predicate equality-predicate-function)
</pre>
</div>
<p>
<code>comparator-function</code> and <code>equality-predicate-function</code> are
functions of two arguments that return a generalized boolean.
</p>

<p>
To illustrate:
</p>
<div class="org-src-container">

<pre class="src src-lisp">(select table :ordered t) ;; sort using all columns and default comparators
(select table :ordered 'column-a) ;; sort based on contents of column-a
(select table :ordered '(column-a column-d)) ;; sort based on column-a, use column-d for tie-breakers
(select table :ordered '((column-f #'string&gt;)) ;; sort using #'string&gt; on column-f
(select table :ordered (list (list column-a (lambda (x y)
					      (&gt; (abs x)
						 (sin y))))
			     (list column-f #'string&gt;)))
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> <i>Function</i> matching</h4>
<div class="outline-text-4" id="text-4-2-3">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-2-3-1">
<p>
<b>matching</b> table &amp;rest names-and-value-tests → row-matching-function
</p>
</div>
</li>

<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-2-3-2">
<dl class="org-dl">
<dt> table </dt><dd>a square table
</dd>
<dt> names-and-values </dt><dd>list of name value-test pairs
</dd>
<dt> row-matching-function </dt><dd>a function of one argument, a table
row accessor
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-2-3-3">
<p>
Returns a function that matches rows with specific column values.
<i>name-and-value-tests</i> is a list of <i>name-and-value-test</i> pairs.
Each pair is a two element list.  The first element is a column
name.  The second element is either a value or a function of one
argument.
</p>

<p>
The normalized value is compared using the column comparator
against the column value of each row.  The function is called
on the column value.  The function returns a generalized boolean
which is used to determine whether the row satisfies the matching
test.
</p>

<p>
The name-and-value-tests are executed until the first pair fails,
when the matching operation fails.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Table operations</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> <i>Function</i> delete-all-rows</h4>
<div class="outline-text-4" id="text-4-3-1">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-1-1">
<p>
Delete all table rows
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> <i>Function</i> delete-rows</h4>
<div class="outline-text-4" id="text-4-3-2">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-2-1">
<p>
Delete rows that match a particular criteria
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> <i>Function</i> insert-row</h4>
<div class="outline-text-4" id="text-4-3-3">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-3-1">
<p>
Insert data into the next table row
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> <i>Function-maybe</i> column</h4>
<div class="outline-text-4" id="text-4-3-4">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-4-1">
<p>
Low level set-efable function that access the table column.  It
bypasses sequence type checking.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> <i>Function</i> column-value</h4>
<div class="outline-text-4" id="text-4-3-5">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-5-1">
<p>
Low-level function set-efable  access to a cell value in a column.
This function bypasses all type and value checking and
normalization.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> <i>Function</i> sorted-rows</h4>
<div class="outline-text-4" id="text-4-3-6">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-3-6-1">
<p>
Sorts rows according to sorting criteria for the specified
column names
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Access to table elements</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><a id="0wqhhju04gg0" name="0wqhhju04gg0"></a><span class="section-number-4">4.4.1</span> <i>Function</i> <b>advance-row</b></h4>
<div class="outline-text-4" id="text-4-4-1">
</div>

<ol class="org-ol"><li>Calling convention<br  /><div class="outline-text-5" id="text-4-4-1-1">
<p>
<b>advance-row</b> row &amp;optional index eot-error-p eot-value → row
</p>
</div>
</li>
<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-4-1-2">
<dl class="org-dl">
<dt> row </dt><dd>a row accessor.
</dd>
<dt> index </dt><dd>a positive integer.  The default is 1.
</dd>
<dt> eot-error-p </dt><dd>a generalized boolean.  The default is true.
</dd>
<dt> eot-value </dt><dd>an object.  The default is nil
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-1-3">
<p>
Increments row-index by the value of <i>index</i>.  If it tries to
advance beyond the last row, it acts according to <i>eot-error-p</i>.
</p>
</div>
</li>
<li>Exceptional Situations<br  /><div class="outline-text-5" id="text-4-4-1-4">
<p>
If <i>eof-table-p</i> is true, <b>end-of-table</b> is signaled at the end
of the table.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> <i>Function</i> <code>cell-value</code></h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
<b>Note</b> function <code>cell-value</code> has been replaced by the generic
 function <code>value</code>
</p>
</div>
</div>

<div id="outline-container-sec-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> <i>Function</i> <code>column-values</code></h4>
<div class="outline-text-4" id="text-4-4-3">
</div><ol class="org-ol"><li>Note<br  /><div class="outline-text-5" id="text-4-4-3-1">
<p>
Should I use a single generic function to access table values
using either a table or a row accessor.
</p>
</div>
</li>
<li>Syntax:<br  /><div class="outline-text-5" id="text-4-4-3-2">
<p>
<i>column-values</i> table column-selector → <i>sequence</i>
</p>
</div>
</li>
<li>Arguments and Values:<br  /><div class="outline-text-5" id="text-4-4-3-3">
<dl class="org-dl">
<dt> table </dt><dd>a table
</dd>
<dt> column-selector </dt><dd>Column name or index
</dd>
<dt> sequence </dt><dd>A valid CL sequence
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-3-4">
<p>
Returns a sequence of values stored in a column.  The sequence type
is determined by <code>*raw-container-type*</code>
</p>

<p>
If the selector fails to find a match, the correctable error
<code>nonexistent-column</code> is thrown.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> <i>Macro</i> <b>do-rows</b></h4>
<div class="outline-text-4" id="text-4-4-4">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-4-4-1">
<p>
<b>do-rows</b> (var table [result-form]) declaration* statement
</p>
</div>
</li>

<li>Arguments and Values:<br  /><div class="outline-text-5" id="text-4-4-4-2">
<dl class="org-dl">
<dt> var </dt><dd>a symbol
</dd>
<dt> table </dt><dd>a form that evaluates to a table
</dd>
<dt> result-form </dt><dd>if a <i>return</i> or <i>return-from</i> form is executed,
the values passed from that form; otherwise, the
values returned by the <i>result-form</i> or nil if
there is no result-form.
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-4-3">
<p>
iterate over rows of the table.  <i>var</i> accesses a successive
table rows.  
</p>

<p>
For file-based read-only tables, the loop terminates at end of
file.  For file-based write-only tables, the macro actions are
unspecified.
</p>

<p>
For all other tables, the loop terminates when the end of the
table is reached.
</p>
</div>
</li></ol>
</div>
