doc/user-doc/mv-table-user-documentation.org
**** Syntax
     *do-rows** ((&rest var-table-pairs) [result-form]) declaration* statement
**** Arguments and Values:
     - var-table-pairs :: a pair of a row (a symbol) and a form that
          evaluates to a table
     - result-form :: if a /return/ or /return-from/ form is executed,
                      the values passed from that form; otherwise, the
                      values returned by the /result-form/ or nil if
                      there is no result-form.

**** Description
     Iterate in parallel over rows of multiple tables.  /var/ accesses
     a successive table rows.

     A var-table pair is a two-element list.
     
     For file-based read-only tables, the loop terminates at end of
     file.  For file-based write-only tables, the macro actions are
     unspecified.

     For all other tables, the loop terminates when the end of the
     table is reached.
*** /Condition/ *end-of-table*

    Raised when trying to access a row beyond the end of a table
*** /Function/ nth-row
**** Description
     Low level function that returns the nth-row accessor object.
     Rows will ideally be accessed with the 
*** /Macro/ map-rows
*** /Condition/ =nonexistent-row=
    Raised when applying a row-selector to a table returns nil
*** /Condition/ =nonexistent-column=
    Raised when applying a column-selector to a table returns nil
*** /Function/ *row-index*
**** Syntax
     *row-index* row → index

     (=setf= (*row-index* row) index)
**** Arguments and Values:
     - row :: a row accessor
     - index :: an integer

**** Description
     Access table row specified by /index/.  Being setf-able, it
     supports =incf=, =decf=.
     
*** /Function/ =row-values=

**** Calling convention
     /row-values/ table row-selector → /sequence/

     - table :: a table
     - row-selector :: row-selector - either a row index or a function
                   that when applied to a table row returns a
                   generalized boolean
     - sequence :: A valid CL sequence
       
**** Description
     Returns a sequence of values stored in a row.  The sequence type
     is determined by =*raw-container-type*=.

     If the selector fails to find a match, the correctable error
     =non-existent-row= is thrown.
*** /Function/ ~table-row~

**** Syntax
     *table-row* table row-selector → row-accessor

**** Arguments and values
     - table :: a square table
     - row-selector :: a function that returns a generalized boolean
                       when applied to table rows
     - row-accessor :: an object whose methods access row values

**** Description
     Returns row accessor object pointing to the first table row that
     matches the criteria of the row-selector.

     If the selector fails to find a match, the correctable error
     =non-existent-row= is thrown.
     
*** /Function/ =table-value=
    
**** Syntax:
     *table-value* table row-selector column-selector → value

     *Note:* =table-value= has been superseded by =value=
*** /Generic Function/ *value*
**** Syntax
     *value* container column-name &optional row-selector -> value

     (setf (*value* container column-name &optional row-selector)
     value)

**** Arguments and values
     - container :: a table or a table row accessor
     - column-name :: a symbol
     - row-selector :: a function of one argument, a row accessor
     - value :: a value stored in a table cell
**** Description
     The function used to access values in a table.  If /container/ is
     a table, it accesses the column value of the first row that
     satisfies the row-selector.

     If /container/ is a row-accessor, it accesses that row's value.

     Setting the value to =+null+= sets the value to empty.

     Throws correctable errors =nonexistent-row= or
     =nonexistent-column= if a selector fails to find a match.  The
     order in which the selectors are applied is unspecified.
*** /Macro/ ~with-columns~

**** Description
     Binds variables to column vectors.

**** Note
     This macro's behavior is undefined if the table uses a matrix for
     internal storage

*** /Macro/ ~with-column-values~

**** Descritpion
     Binds variables to row values

** Other operations
*** /Function/ load-table
**** Description
     load table from stream
*** /Function/ table
*** /Function/ table-size
**** Description
     Return the number of rows and columns as a two-element list.

