documentation/user-doc/mv-table-user-documentation.html

<div id="outline-container-sec-4-4-5" class="outline-4">
<h4 id="sec-4-4-5"><span class="section-number-4">4.4.5</span> <i>Macro</i> <b>do-rows*</b></h4>
<div class="outline-text-4" id="text-4-4-5">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-4-5-1">
<p>
<b>do-rows*</b> ((&amp;rest var-table-pairs) [result-form]) declaration* statement
</p>
</div>
</li>

<li>Arguments and Values:<br  /><div class="outline-text-5" id="text-4-4-5-2">
<dl class="org-dl">
<dt> var-table-pairs </dt><dd>a pair of a row (a symbol) and a form that
evaluates to a table
</dd>
<dt> result-form </dt><dd>if a <i>return</i> or <i>return-from</i> form is executed,
the values passed from that form; otherwise, the
values returned by the <i>result-form</i> or nil if
there is no result-form.
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-5-3">
<p>
Iterate in parallel over rows of multiple tables.  <i>var</i> accesses
a successive table rows.
</p>

<p>
A var-table pair is a two-element list.
</p>

<p>
For file-based read-only tables, the loop terminates at end of
file.  For file-based write-only tables, the macro actions are
unspecified.
</p>

<p>
For all other tables, the loop terminates when the end of the
table is reached.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-6" class="outline-4">
<h4 id="sec-4-4-6"><span class="section-number-4">4.4.6</span> <i>Condition</i> <b>end-of-table</b></h4>
<div class="outline-text-4" id="text-4-4-6">
<p>
Raised when trying to access a row beyond the end of a table
</p>
</div>
</div>

<div id="outline-container-sec-4-4-7" class="outline-4">
<h4 id="sec-4-4-7"><span class="section-number-4">4.4.7</span> <i>Function</i> nth-row</h4>
<div class="outline-text-4" id="text-4-4-7">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-4-7-1">
<p>
Low level function that returns the nth-row accessor object.
Rows will ideally be accessed with the 
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-8" class="outline-4">
<h4 id="sec-4-4-8"><span class="section-number-4">4.4.8</span> <i>Macro</i> map-rows</h4>
</div>
<div id="outline-container-sec-4-4-9" class="outline-4">
<h4 id="sec-4-4-9"><span class="section-number-4">4.4.9</span> <i>Condition</i> <code>nonexistent-row</code></h4>
<div class="outline-text-4" id="text-4-4-9">
<p>
Raised when applying a row-selector to a table returns nil
</p>
</div>
</div>

<div id="outline-container-sec-4-4-10" class="outline-4">
<h4 id="sec-4-4-10"><span class="section-number-4">4.4.10</span> <i>Condition</i> <code>nonexistent-column</code></h4>
<div class="outline-text-4" id="text-4-4-10">
<p>
Raised when applying a column-selector to a table returns nil
</p>
</div>
</div>

<div id="outline-container-sec-4-4-11" class="outline-4">
<h4 id="sec-4-4-11"><span class="section-number-4">4.4.11</span> <i>Function</i> <b>row-index</b></h4>
<div class="outline-text-4" id="text-4-4-11">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-4-11-1">
<p>
<b>row-index</b> row → index
</p>

<p>
(<code>setf</code> (<b>row-index</b> row) index)
</p>
</div>
</li>

<li>Arguments and Values:<br  /><div class="outline-text-5" id="text-4-4-11-2">
<dl class="org-dl">
<dt> row </dt><dd>a row accessor
</dd>
<dt> index </dt><dd>an integer
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-11-3">
<p>
Access table row specified by <i>index</i>.  Being setf-able, it
supports <code>incf</code>, <code>decf</code>.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-4-12" class="outline-4">
<h4 id="sec-4-4-12"><span class="section-number-4">4.4.12</span> <i>Function</i> <code>row-values</code></h4>
<div class="outline-text-4" id="text-4-4-12">
</div><ol class="org-ol"><li>Calling convention<br  /><div class="outline-text-5" id="text-4-4-12-1">
<p>
<i>row-values</i> table row-selector → <i>sequence</i>
</p>

<dl class="org-dl">
<dt> table </dt><dd>a table
</dd>
<dt> row-selector </dt><dd>row-selector - either a row index or a function
that when applied to a table row returns a
generalized boolean
</dd>
<dt> sequence </dt><dd>A valid CL sequence
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-12-2">
<p>
Returns a sequence of values stored in a row.  The sequence type
is determined by <code>*raw-container-type*</code>.
</p>

<p>
If the selector fails to find a match, the correctable error
<code>non-existent-row</code> is thrown.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-13" class="outline-4">
<h4 id="sec-4-4-13"><span class="section-number-4">4.4.13</span> <i>Function</i> <code>table-row</code></h4>
<div class="outline-text-4" id="text-4-4-13">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-4-13-1">
<p>
<b>table-row</b> table row-selector → row-accessor
</p>
</div>
</li>
<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-4-13-2">
<dl class="org-dl">
<dt> table </dt><dd>a square table
</dd>
<dt> row-selector </dt><dd>a function that returns a generalized boolean
when applied to table rows
</dd>
<dt> row-accessor </dt><dd>an object whose methods access row values
</dd>
</dl>
</div>
</li>
<li>Description<br  /><div class="outline-text-5" id="text-4-4-13-3">
<p>
Returns row accessor object pointing to the first table row that
matches the criteria of the row-selector.
</p>

<p>
If the selector fails to find a match, the correctable error
<code>non-existent-row</code> is thrown.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-4-14" class="outline-4">
<h4 id="sec-4-4-14"><span class="section-number-4">4.4.14</span> <i>Function</i> <code>table-value</code></h4>
<div class="outline-text-4" id="text-4-4-14">
</div><ol class="org-ol"><li>Syntax:<br  /><div class="outline-text-5" id="text-4-4-14-1">
<p>
<b>table-value</b> table row-selector column-selector → value
</p>

<p>
<b>Note:</b> <code>table-value</code> has been superseded by <code>value</code>
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-15" class="outline-4">
<h4 id="sec-4-4-15"><span class="section-number-4">4.4.15</span> <i>Generic Function</i> <b>value</b></h4>
<div class="outline-text-4" id="text-4-4-15">
</div><ol class="org-ol"><li>Syntax<br  /><div class="outline-text-5" id="text-4-4-15-1">
<p>
<b>value</b> container column-name &amp;optional row-selector -&gt; value
</p>

<p>
(setf (<b>value</b> container column-name &amp;optional row-selector)
value)
</p>
</div>
</li>
<li>Arguments and values<br  /><div class="outline-text-5" id="text-4-4-15-2">
<dl class="org-dl">
<dt> container </dt><dd>a table or a table row accessor
</dd>
<dt> column-name </dt><dd>a symbol
</dd>
<dt> row-selector </dt><dd>a function of one argument, a row accessor
</dd>
<dt> value </dt><dd>a value stored in a table cell
</dd>
</dl>
</div>
</li>

<li>Description<br  /><div class="outline-text-5" id="text-4-4-15-3">
<p>
The function used to access values in a table.  If <i>container</i> is
a table, it accesses the column value of the first row that
satisfies the row-selector.
</p>

<p>
If <i>container</i> is a row-accessor, it accesses that row's value.
</p>

<p>
Setting the value to <code>+null+</code> sets the value to empty.
</p>

<p>
Throws correctable errors <code>nonexistent-row</code> or
<code>nonexistent-column</code> if a selector fails to find a match.  The
order in which the selectors are applied is unspecified.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-4-16" class="outline-4">
<h4 id="sec-4-4-16"><span class="section-number-4">4.4.16</span> <i>Macro</i> <code>with-columns</code></h4>
<div class="outline-text-4" id="text-4-4-16">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-4-16-1">
<p>
Binds variables to column vectors.
</p>
</div>
</li>
<li>Note<br  /><div class="outline-text-5" id="text-4-4-16-2">
<p>
This macro's behavior is undefined if the table uses a matrix for
internal storage
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-4-17" class="outline-4">
<h4 id="sec-4-4-17"><span class="section-number-4">4.4.17</span> <i>Macro</i> <code>with-column-values</code></h4>
<div class="outline-text-4" id="text-4-4-17">
</div><ol class="org-ol"><li>Descritpion<br  /><div class="outline-text-5" id="text-4-4-17-1">
<p>
Binds variables to row values
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Other operations</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> <i>Function</i> load-table</h4>
<div class="outline-text-4" id="text-4-5-1">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-5-1-1">
<p>
load table from stream
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> <i>Function</i> table</h4>
</div>
<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3"><span class="section-number-4">4.5.3</span> <i>Function</i> table-size</h4>
<div class="outline-text-4" id="text-4-5-3">
</div><ol class="org-ol"><li>Description<br  /><div class="outline-text-5" id="text-4-5-3-1">
<p>
Return the number of rows and columns as a two-element list.
</p>
</div>
</li></ol>
</div>
</div>
</div>
